NetologySlow/src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <registerRecords>AccumulationRegister.Доходы</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыИУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

NetologySlow/src/Documents/РеализацияТоваровИУслуг/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Функция СуммаПоСтроке(ИзмененнаяСтрока)   //0.0   //работает
	//возвращает сумму с учетом количества, цены и скидки
	ИзмененнаяСтрока.СуммаСкидки=ИзмененнаяСтрока.Количество*ИзмененнаяСтрока.Цена*ИзмененнаяСтрока.Скидка/100; 
	ИзмененнаяСтрока.Сумма=ИзмененнаяСтрока.Количество*ИзмененнаяСтрока.Цена+ИзмененнаяСтрока.СуммаСкидки; 
	ИзмененнаяСтрока.СуммаСНДС=ИзмененнаяСтрока.Сумма+ИзмененнаяСтрока.СуммаНДС; 
КонецФункции   

 &НаКлиенте
Процедура ТоварыИУслугиНоменклатураПриИзменении(Элемент)      //1.0 Номенклатура
	// передать в качестве параметра ТекущиеДанные таблицы   
	ИзмененнаяСтрока=Элементы.ТоварыИУслуги.ТекущиеДанные; 
	ПриИзмененииНоменклатуры(ИзмененнаяСтрока); 
КонецПроцедуры     

 &НаКлиенте
Процедура  ПриИзмененииНоменклатуры(ИзмененнаяСтрока)    //1.1 Номенклатура
	// Заполнять цену и скидку аналогично документам УстановкаЦен и УстановкаСкидок,    !!!
	//а также заполнять ставку НДС(+) и вызывать процедуры ПриИзмененииЦены, ПриИзмененииСкидки и ПриИзмененииСтавкиНДС     
	Если ЗначениеЗаполнено(ИзмененнаяСтрока.Номенклатура) Тогда 
		Номенклатура=ИзмененнаяСтрока.Номенклатура;   
		Дата=Объект.Дата; 
		ЦенаНоменклатуры=ЦеныВызовСервера.ЦенаНаДату(Номенклатура,Дата); 
		ИзмененнаяСтрока.Цена=ЦенаНоменклатуры;  
		
		ПриИзмененииЦены(ИзмененнаяСтрока);   
		
		СкидкаНоменклатуры=ЦеныВызовСервера.СкидкаНаДату(Номенклатура,Дата);
        ИзмененнаяСтрока.Скидка=СкидкаНоменклатуры;   
		
		ПриИзмененииСкидки(ИзмененнаяСтрока);
		
		ИзмененнаяСтрока.СтавкаНДС=ПолучитьСтавкуНДС(Номенклатура);    
		
		ПриИзмененииСтавкиНДС(ИзмененнаяСтрока);    
	КонецЕсли; 
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция  ПолучитьСтавкуНДС(Номенклатура) 
	СтавкаНДС=Номенклатура.СтавкаНДС; 
	Возврат СтавкаНДС; 
КонецФункции

&НаКлиенте
Процедура ТоварыИУслугиКоличествоПриИзменении(Элемент)       //2.0 Количество
	// передать в качестве параметра ТекущиеДанные таблицы   
	ИзмененнаяСтрока=Элементы.ТоварыИУслуги.ТекущиеДанные; 
    ПриИзмененииКоличества(ИзмененнаяСтрока); 
КонецПроцедуры  

 &НаКлиенте
Процедура  ПриИзмененииКоличества(ИзмененнаяСтрока)     //2.1 Количество
	// Рассчитывать сумму вызовом СуммаПоСтроке()(0) и вызывать 
	Количество=ИзмененнаяСтрока.Количество; 
	СуммаПоСтроке(ИзмененнаяСтрока);    
	ПриИзмененииСуммы(ИзмененнаяСтрока);
КонецПроцедуры  

&НаКлиенте
Процедура ТоварыИУслугиЦенаПриИзменении(Элемент) //3.0 Цена
	// передать в качестве параметра ТекущиеДанные таблицы      
	ИзмененнаяСтрока=Элементы.ТоварыИУслуги.ТекущиеДанные; 
    ПриИзмененииЦены(ИзмененнаяСтрока); 
КонецПроцедуры

&НаКлиенте
Процедура  ПриИзмененииЦены(ИзмененнаяСтрока)    //3.1 Цена
	// Рассчитывать сумму вызовом СуммаПоСтроке()(0) и вызывать 
	//ПриИзмененииСуммы();  
	Цена=ИзмененнаяСтрока.Цена; 
	СуммаПоСтроке(ИзмененнаяСтрока);    
	ПриИзмененииСуммы(ИзмененнаяСтрока);
КонецПроцедуры    

&НаКлиенте
Процедура ТоварыИУслугиСкидкаПриИзменении(Элемент)    //4.0 Скидка
	// передать в качестве параметра ТекущиеДанные таблицы    
	 ИзмененнаяСтрока=Элементы.ТоварыИУслуги.ТекущиеДанные; 
     ПриИзмененииСкидки(ИзмененнаяСтрока); 
 КонецПроцедуры   
 
 &НаКлиенте
Процедура  ПриИзмененииСкидки(ИзмененнаяСтрока)  //4.1 Скидка
	// Рассчитывать сумму вызовом СуммаПоСтроке()(0) и вызывать 
	//ПриИзмененииСуммы();  
	Скидка=ИзмененнаяСтрока.Скидка; 
	СуммаПоСтроке(ИзмененнаяСтрока);    
	ПриИзмененииСуммы(ИзмененнаяСтрока);
КонецПроцедуры   

&НаКлиенте
Процедура ТоварыИУслугиСтавкаНДСПриИзменении(Элемент)  //5.0 Ставка НДС
	// передать в качестве параметра ТекущиеДанные таблицы   
	ИзмененнаяСтрока=Элементы.ТоварыИУслуги.ТекущиеДанные; 
    ПриИзмененииСтавкиНДС(ИзмененнаяСтрока); 
КонецПроцедуры   

 &НаКлиенте
Процедура  ПриИзмененииСтавкиНДС(ИзмененнаяСтрока) //5.1 Ставка НДС
	// Рассчитывать сумму НДС по сумме и ставке вызовом НДСКлиентСервер.СуммаНДСПоСтавке()  
	ИзмененнаяСтрока.СуммаНДС=НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
	ПриИзмененииСуммаНДС(ИзмененнаяСтрока); 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиСуммаПриИзменении(Элемент)   //6.0 Сумма
	// передать в качестве параметра ТекущиеДанные таблицы    
	ИзмененнаяСтрока=Элементы.ТоварыИУслуги.ТекущиеДанные; 
	ИзмененнаяСтрока.Цена=ИзмененнаяСтрока.Сумма/ИзмененнаяСтрока.Количество;   //на копейки ломается механизм подсчета СуммыНДС и СуммыСНДС из-за скидки  
	//ИзмененнаяСтрока.Скидка=100*(1-ИзмененнаяСтрока.Сумма/ИзмененнаяСтрока.Количество/ИзмененнаяСтрока.Цена);  //Пересчитывется сумма и всё ломается
	ИзмененнаяСтрока.Сумма=ИзмененнаяСтрока.Количество*ИзмененнаяСтрока.Цена+ИзмененнаяСтрока.СуммаСкидки; 
	ПриИзмененииСуммы(ИзмененнаяСтрока); 
КонецПроцедуры 

&НаКлиенте
Процедура  ПриИзмененииСуммы(ИзмененнаяСтрока)    //6.1 Сумма
	// Рассчитывать сумму НДС по сумме и ставке вызовом НДСКлиентСервер.СуммаНДСПоСтавке()   
	ИзмененнаяСтрока.СуммаНДС=НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
	ПриИзмененииСуммаНДС(ИзмененнаяСтрока);
КонецПроцедуры   

&НаКлиенте
Процедура ТоварыИУслугиСуммаНДСПриИзменении(Элемент)  // 7.0 Сумма НДС   (моя добавка) 
	// передать в качестве параметра ТекущиеДанные таблицы    
	ИзмененнаяСтрока=Элементы.ТоварыИУслуги.ТекущиеДанные; 
	ПриИзмененииСуммаНДС(ИзмененнаяСтрока); 
КонецПроцедуры   

 &НаКлиенте
Процедура  ПриИзмененииСуммаНДС(ИзмененнаяСтрока)   //7.1 СуммаНДС (моя добавка)  
	// Рассчитывать сумму НДС по сумме и ставке вызовом НДСКлиентСервер.СуммаНДСПоСтавке()    
	СуммаНДС=ИзмененнаяСтрока.СуммаНДС; 
	СуммаПоСтроке(ИзмененнаяСтрока);
КонецПроцедуры   

&НаКлиенте
Процедура Подбор(Команда)  //9
	
	ПараметрыФормы=Новый Структура; 
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь); 
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",ПараметрыФормы,Элементы.ТоварыИУслуги); 

КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;   
	//вызвать процедуру ПриИзмененииНоменклатуры, чтобы обеспечить получение цен и скидок и автоматический пересчет сумм.
	ЭлементВыбора=Новый Структура; 
	ЭлементВыбора.Вставить("Номенклатура",ВыбранноеЗначение); 
	Результат=Объект.ТоварыИУслуги.НайтиСтроки(ЭлементВыбора); 
	
	Если Результат.Количество()=0 Тогда
		ИзмененнаяСтрока=Объект.ТоварыИУслуги.Добавить(); 
		ИзмененнаяСтрока.Номенклатура=ВыбранноеЗначение; 
		ПриИзмененииНоменклатуры(ИзмененнаяСтрока);  
	Иначе Сообщить(СтрШаблон("Номенклатура %1 уже есть в списке", ВыбранноеЗначение)); 
    КонецЕсли; 


КонецПроцедуры
